Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedNodeLoad Properties
The AnalysisDecomposedNodeLoad type exposes the following members.
Properties
Name | Description
AnalysisLoadType
 Gets or sets the type of the analysis decomposed load.
 (Inherited from AnalysisDecomposedLoad.)
AnalysisModelName
 Gets or sets the analysis model name.
 (Inherited from AnalysisObject.)
AnalysisObjectType
 Gets or sets the type of the analysis object.
 (Inherited from AnalysisObject.)
F
 Gets or sets the force of the analysis decomposed node load.
FatherObject2ID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObject2Type
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
FatherObjectID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObjectType
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
ID
 Gets or sets the identifier of the analysis object.
 (Inherited from AnalysisObject.)
M
 Gets or sets the moment of the analysis decomposed node load.
ModelLoadGroupID
 Gets or sets the identifier of the load group.
 (Inherited from AnalysisDecomposedLoad.)
ModelLoadID
 Gets or sets the identifier of the model load.
 (Inherited from AnalysisDecomposedLoad.)
ObjectAttachedToID
 Gets or sets the identifier of the object the load is attached to.
 (Inherited from AnalysisDecomposedLoad.)
ObjectAttachedToType
 Gets or sets the type of the object the load is attached to.
 (Inherited from AnalysisDecomposedLoad.)
Top
See Also
Reference
AnalysisDecomposedNodeLoad Class
Tekla.Structures.Analysis Namespace